{
  "content": {
    "colors": {
      "M": "<b> Material </b> provides alerts box in four colors as you can see in the below display box.<span class='codeSnippet'>severity</span> prop not only gives color to the Alert component, but sets an <span class='codeSnippet'> icon </span> as well as per the severity value. <span class='codeSnippet'> color </span> property can also be used, but by default it sets the icon for its values as <span class='codeSnippet'> checkCircleOutline </span>. Thus you can remove or override icon using the <span class='codeSnippet'> icon </span> prop. Set it to <span class='codeSnippet'> false </span> to remove icon or specify some other material icon.",
      "B": "<b> Bootstrap </b> provides a variety of colors for their Alert box which can be applied using its <span class='codeSnippet'> variant </span> prop. By default, its variant props has <span class='codeSnippet'> primary </span> value. Also, bootstrap dosen't apply any icons to its Alert by default. You have to use <span class='codeSnippet'> bootstrap-icons </span> with the <span class='codeSnippet'> &lt;i&gt;&lt;/i&gt; </span> tags as shown below in order to include icons alongwith alert content."
    },
    "alertContent": {
      "M": "<b> Material </b> provides with <span class='codeSnippet'> &lt;AlertTitle/&gt; </span> component for adding heading/title to the Alert component.",
      "B": "<b> Bootstrap </b> has two components, namely <span class='codeSnippet'> &lt;Alert.Heading/&gt; </span> & <span class='codeSnippet'> &lt;Alert.Link/&gt; </span> for adding heading and links to our component."
    },
    "variants": {
      "M": "<b> Material </b> provides variety of variants from which <span class='codeSnippet'> standard </span> is the <span className='codeSnippet'> default </span> one.",
      "B": "<b> Bootstrap </b> dosen't provide any other Alert variants other than its standard filled Alert. But you can customize them by providing <span class='codeSnippet'> inline styles </span> or <span className='codeSnippet'> overriding </span> bootstrap classes."
    },
    "dismissable": {
      "M": "In <b> Material </b> an alert can have an <span class='codeSnippet'> action </span> , such as a close button. If an <span class='codeSnippet'> onClose </span> prop is set and no <span class='codeSnippet'> action </span> props is there, then a <span class='codeSnippet'> close </span> icon is displayed by default, else you can provide your custom icon or button in action.",
      "B": "<b> Bootstrap </b> allows you to set <span className='codeSnippet'> dismissible </span> props to your alert and displays a close icon by default. Further functionality is displayed in code using <span className='codeSnippet'> const [open,setOpen] = useState </span>, react hooks."
    }
  }
}
